# Pandas Overview

_Note:_ these examples were taken from Wes McKinney's _Python for Data Analysis_.

[Series](#series)  
[Data Frames](#dataframes)  
[Indexing](#indexing)  
[Selection and Filtering](#selection_filtering)  
[Arithmetic and Data Alignment](#arithmetic)  
[Sorting and Ranking](#sorting_ranking)  
[Summarizing and Computing Descriptive Statistics](#summ)  
[Handling Missing Data](#nans)  
[Merging](#merging)  
[Joining](#joining)  
[Concatenating](#concat)  
[Combining with Overlap](#combining)  
[Stacking](#stacking)  
[Duplicates](#duplicates)  
[Mapping](#mapping)  
[Replacing Values](#replacing)  
[Renaming Axis Indexes](#renaming)  
[Discretization and Binning](#binning)  
[Permutations and Random Sampling](#perm_rand)  
[String Manipulation](#strings)  
[Grouping and Aggregation](#grouping)  
[Data Grouipuing and Aggregations with Functions](#agg_func)  
[Groupby with Bucketing](#groupby_bucketing)  
[Cards Example](#cards_example)  
[Pivot Tables](#pivot_tables)  
[Crosstabs](#cross_tabs)

<a id='series'></a>
### Series

In [2]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
from IPython.display import display

Series is a one-dimensional array-like object

In [6]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

You can parse out the values and the index of a Series

In [8]:
print obj.values
print obj.index

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

You can specify what the index is

In [13]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

You can change values based on the index

In [14]:
obj2['b']
obj2['b'] = 6
obj2

d    4
b    6
a   -5
c    3
dtype: int64

Basic operations:

In [26]:
print obj2[obj2>0]
print '\n'
print obj2*2
print '\n'
print np.exp(obj2)

d    4
b    6
c    3
dtype: int64


d     8
b    12
a   -10
c     6
dtype: int64


d     54.598150
b    403.428793
a      0.006738
c     20.085537
dtype: float64

You can convert a dict into a Series

In [22]:
sdata = {'Ohio':35000, 'Texas':70000, 'Oregon':16000, 'Utah':50000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     70000
Utah      50000
dtype: int64

You can match the Series index with a list

In [23]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         70000.0
dtype: float64

Detecting nulls

In [25]:
print pd.isnull(obj4)
print '\n'
print pd.notnull(obj4)
print '\n'
print obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool


California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool


California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

Series align indexes

In [29]:
print obj3
print '\n'
print obj4
print '\n'
print obj3+obj4

Ohio      35000
Oregon    16000
Texas     70000
Utah      50000
dtype: int64


California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         70000.0
dtype: float64


California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         140000.0
Utah               NaN
dtype: float64

Both the Series object and the its attribute have a name feature:

In [30]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         70000.0
Name: population, dtype: float64

A Series' index can be altered in place by assignment

In [31]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

<a id='dataframes'></a>
### DataFrames

In [174]:
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002],
        'pop': [1.5,1.7,3.6,2.4,2.9]}
print data
frame = DataFrame(data)
print '\n'
print frame
print '\n'
print 'Index:', frame.index

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9], 'year': [2000, 2001, 2002, 2001, 2002]}


   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002


Index: RangeIndex(start=0, stop=5, step=1)

You can explicitly specify what you want the output to be

In [39]:
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

Creating a new blank colum will generate NaN values:

In [175]:
frame2 = DataFrame(data, columns=['year','state','pop','debt'],
                   index=['one','two','three','four','five'])
display(frame2)
print frame2.columns

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

You can retrieve columns using names or by attribute

In [48]:
display(frame2['state'])
display(frame2.state)

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

Retrieving rows by index:

In [51]:
display(frame2.ix['three'])
display(frame2.ix[['three', 'four']])

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

       year   state  pop debt
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN

In [177]:
frame2.ix[1:]

       year   state  pop debt
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [178]:
frame2.iloc[1:]

       year   state  pop debt
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

_Note:_  
- `loc` works on labels in the index.  
- `iloc` works on the positions in the index (so it only takes integers).  
- `ix` usually tries to behave like loc but falls back to behaving like iloc if the label is not in the index.

Modifying columns

In [52]:
frame2['debt'] = 16.5
display(frame2)
frame2['debt'] = np.arange(5.)
display(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

You can assign a Series to a column in a DF, but indexes must match

In [53]:
val = Series([-1.2,-1.5,-1.7], index=['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

Assigning a column that doesn't exist will create a new column:

In [55]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

Deleting a column:

In [56]:
del frame2['eastern']
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

Nested dicts: inner keys will be interpreted as indices

In [57]:
pop = {'Nevada':{2001:2.4, 2002:2.9},
       'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}
print pop
frame3 = DataFrame(pop)
frame3

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

Transpose

In [58]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

You can always explicitly state your index:

In [61]:
display(pop)
display(DataFrame(pop, index=[2001,2002,2003]))

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

Dict of Series

In [66]:
print frame3
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada':frame3['Nevada'][:2]}
print '\n'
print pdata
display(DataFrame(pdata))

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6


{'Ohio': 2000    1.5
2001    1.7
Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
2001    2.4
Name: Nevada, dtype: float64}

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

You can name the indices AND the columns:

In [67]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

Values are returned as a 2D ndarray

In [68]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

When there are multiple dtypes, the value array dtype will fill all of them

In [69]:
frame2.values

array([[2000L, 'Ohio', 1.5, nan],
       [2001L, 'Ohio', 1.7, -1.2],
       [2002L, 'Ohio', 3.6, nan],
       [2001L, 'Nevada', 2.4, -1.5],
       [2002L, 'Nevada', 2.9, -1.7]], dtype=object)

<a id='indexing'></a>
### Index Objects

In [70]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
print index
print '\n'
print index[1:]

Index([u'a', u'b', u'c'], dtype='object')


Index([u'b', u'c'], dtype='object')

Index objects are immutable

In [71]:
index[1] = 'd'

TypeError: Index does not support mutable operations

This way you can share indices among data structures

In [72]:
index = pd.Index(np.arange(3))
print index
obj2 = Series([1.5, -2.5, 0], index = index)
print obj2.index is index

Int64Index([0, 1, 2], dtype='int64')
True

Indices are also fixed-size sets:

In [73]:
print frame3
print '\n'
print 'Ohio' in frame3.columns
print '\n'
print 2003 in frame3.index

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6


True


False

Reindexing

In [78]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
print obj
print '\n'
obj2 = obj.reindex(['a','b','c','d','e'])
print obj2
print '\n'
obj2 = obj.reindex(['a','b','c','d','e'], fill_value=0)
print obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64


a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64


a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

You can also fill in values while reindexing

In [79]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0,2,4])
print obj3
print '\n'
print obj3.reindex(range(6), method='ffill')

0      blue
2    purple
4    yellow
dtype: object


0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

Reindexing works with rows and with columns:

In [80]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
print frame
print '\n'
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
print frame2

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8


   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

Reindexing columns

In [81]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Both at the same time

In [82]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

This can be done much more succinctly

In [83]:
frame.ix[['a','b','c','d'],states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

Dropping entries from a DataFrame

In [84]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd','e'])
print obj
new_obj = obj.drop('c')
print '\n'
print new_obj
print '\n'
print obj.drop(['d','c'])

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64


a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64


a    0.0
b    1.0
e    4.0
dtype: float64

You can drop columns or index values in the same way

In [88]:
data = DataFrame(np.arange(16).reshape(4,4),
                 index=['Ohio','Colorado','Utah','New York'],
                    columns=['one','two','three','four'])
print data
print '\n'
print data.drop(['Colorado','Ohio'])
print '\n'
print data.drop('two',axis=1)
print '\n'
print data.drop(['two','four'],axis=1)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15


          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15


          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

<a id='selection_filtering'></a>
### Selection and filtering

Series indexing

In [90]:
obj = Series(np.arange(4.), index=['a','b','c','d'])
print obj
print '\n'
print obj['b']
print '\n'
print obj[1]
print '\n'
print obj[2:4]
print '\n'
print obj[['c','d']]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64


1.0


1.0


c    2.0
d    3.0
dtype: float64


c    2.0
d    3.0
dtype: float64

Filtering by values

In [91]:
print obj[[1,3]]
print '\n'
print obj[obj<2]

b    1.0
d    3.0
dtype: float64


a    0.0
b    1.0
dtype: float64

Slicing is endpoint inclusive

In [92]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

Setting

In [93]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

You can retrieve columns as a single value or a sequence

In [97]:
data = DataFrame(np.arange(16).reshape(4,4),
                 index=['Ohio','Colorado','Utah','New York'],
                    columns=['one','two','three','four'])
print data
print '\n'
print data['two']
print '\n'
print data[['three', 'one']]
print '\n'
print data.ix['Ohio']
print '\n'
print data.ix['Ohio', 1]
print '\n'
print data.ix['Ohio', 1:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32


          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12


one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32


1


two    1
Name: Ohio, dtype: int32

Selecting rows by slicing

In [100]:
print data
print '\n'
print data[:2]
print '\n'
print data[data['three']>5]
print '\n'
print data['three']>5
print '\n'
print data < 5
print '\n'
print data[data<5]
print '\n'
print data[data<5] == 0
print '\n'
print data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7


          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool


            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False


          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN


            one    two  three   four
Ohio       True  False  False  False
Colorado  False  False  False  False
Utah      False  False  False  False
New York  False  False  False  False


          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The ix method allows you to select rows and columns using names OR indices:

In [104]:
print data
print '\n'
print data.ix[['Colorado', 'Utah'],[3,0,1]]
print '\n'
print data.ix[2]
print '\n'
print data.ix[:'Utah','two']
print '\n'
print data.ix[data.three>5,:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15


          four  one  two
Colorado     7    4    5
Utah        11    8    9


one       8
two       9
three    10
four     11
Name: Utah, dtype: int32


Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32


          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

_Note:_ row indices are last-inclusive, while columns are last-exclusive

<a id='arithmetic'></a>
### Arithmetic and Data Alignment

Non-matching indices will be unioned when adding two objects (and return NaNs):

In [105]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c','e','f','g'])
print s1
print '\n'
print s2
print '\n'
print s1+s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64


a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64


a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

Lets see the same with a data frame

In [106]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print df1
print '\n'
print df2
print '\n'
print df1+df2

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0


          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0


            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

To get rid of the NaN values, you can use the fill function

In [107]:
df1.add(df2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

Operations between a dataframe and a series

In [109]:
arr= np.arange(12.).reshape((3,4))
print arr
print '\n'
print arr[0]
print '\n'
print arr - arr[0]

[[  0.   1.   2.   3.]
 [  4.   5.   6.   7.]
 [  8.   9.  10.  11.]]


[ 0.  1.  2.  3.]


[[ 0.  0.  0.  0.]
 [ 4.  4.  4.  4.]
 [ 8.  8.  8.  8.]]

Data frames and series will use the index in the series

In [110]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), 
                  index=['Utah','Ohio','Texas','Oregon'])
series = frame.ix[0]
print frame
print '\n'
print series
print '\n'
print frame-series

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0


b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64


          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If the index value is not found, the objects will be reindexed

In [111]:
series2 = Series(range(3), index=['b','e','f'])
print series2
print '\n'
print frame + series2

b    0
e    1
f    2
dtype: int64


          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

Broadcasting over columns, matching on the rows:

In [112]:
series3 = frame['d']
print series3
print '\n'
print frame
print '\n'
print frame.sub(series3, axis=0)

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64


          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0


          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

Function application and mapping

In [113]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print frame
print '\n'
print np.abs(frame)

               b         d         e
Utah   -1.819489 -0.322406  0.004895
Ohio    1.958106  1.393432  0.870651
Texas  -0.272886 -0.590315  0.242086
Oregon -1.917845 -0.585628  1.634763


               b         d         e
Utah    1.819489  0.322406  0.004895
Ohio    1.958106  1.393432  0.870651
Texas   0.272886  0.590315  0.242086
Oregon  1.917845  0.585628  1.634763

The 'apply' method

In [114]:
f = lambda x: x.max() - x.min()
print frame.apply(f)
print '\n'
print frame.apply(f,axis=1)

b    3.875951
d    1.983746
e    1.629868
dtype: float64


Utah      1.824384
Ohio      1.087455
Texas     0.832401
Oregon    3.552608
dtype: float64

Applymap allows you to apply the function to every cell in the data frame

In [118]:
format = lambda x: '%.2f' % x
frame.applymap(format) # apply only appears to work for Series

            b      d     e
Utah    -1.82  -0.32  0.00
Ohio     1.96   1.39  0.87
Texas   -0.27  -0.59  0.24
Oregon  -1.92  -0.59  1.63

<a id='sorting_ranking'></a>
### Sorting and ranking

In [125]:
obj = Series(range(4), index=['d','a','b','c'])
print obj
print '\n'
print obj.sort_index()

d    0
a    1
b    2
c    3
dtype: int64


a    1
b    2
c    3
d    0
dtype: int64

Sort data frame with the index of either axis

In [126]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'],
                  columns=['d','a','b','c'])
print frame
print '\n'
print frame.sort_index()
print '\n'
print frame.sort_index(axis=1)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7


       d  a  b  c
one    4  5  6  7
three  0  1  2  3


       a  b  c  d
three  1  2  3  0
one    5  6  7  4

Ascending is default, but we can change that

In [127]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

Sorting a series by its values requires the 'sort_values' method:

In [129]:
obj = Series([4,7,-3,2])
print obj
print '\n'
print obj.sort_values()

0    4
1    7
2   -3
3    2
dtype: int64


2   -3
3    2
0    4
1    7
dtype: int64

Missing values are added to the end of the series

In [130]:
obj = Series([4,np.nan, 7, np.nan, -3, 2])
print obj
print '\n'
print obj.sort_values()

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64


4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

Sorting a data frame by one or more columns:

In [132]:
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
print frame
print '\n'
print frame.sort_values(by='b')
print '\n'
print frame.sort_values(by=['a','b'])

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2


   a  b
2  0 -3
3  1  2
0  0  4
1  1  7


   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

Rank tells us where each row ranks; ties are broken using the mean ranks:

In [133]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
print obj
print '\n'
print obj.rank()

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64


0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

The 'first' method breaks ties based on the index of each value:

In [134]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

Ranking in descending order

In [135]:
obj.rank(ascending=False, method='first')

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

Data frame ranking can be done on rows OR columns

In [137]:
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1], 
                   'c':[-2,5,8,-2.5]})
print frame
print '\n'
print frame.rank()
print '\n'
print frame.rank(axis=1)

   a  b    c
0  0  4 -2.0
1  1  7  5.0
2  0 -3  8.0
3  1  2 -2.5


     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0


     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

Axis indexing with duplicate values:

In [140]:
obj = Series(range(5), index=['a','a','b','b','c'])
print obj
print '\n'
print obj.index.is_unique
print '\n'
print obj['a']
print '\n'
print obj['c']

a    0
a    1
b    2
b    3
c    4
dtype: int64


False


a    0
a    1
dtype: int64


4

<a id='summ'></a>
### Summarizing and Computing Descriptive Statistics

In [141]:
df = DataFrame([[1.4,None], [7.1, -4.5],
               [np.nan, np.nan], [.75, -1.4]], 
                index=['a','b','c','d'],
                columns=['one','two'])
display(df)
display(df.sum())
display(df.sum(axis=1))

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.4

one    9.25
two   -5.90
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.65
dtype: float64

NA values are excluded from the calculation, unless otherwise specified

In [142]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.325
dtype: float64

Cumulative methods

In [143]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.9

Summary stats

In [145]:
print '\n'
print df.describe()
print '\n'
print df.describe().applymap(format)
obj = Series(['a','b','c','c']*4)
print '\n'
print obj
print '\n'
print obj.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.950000
std    3.493685  2.192031
min    0.750000 -4.500000
25%         NaN       NaN
50%         NaN       NaN
75%         NaN       NaN
max    7.100000 -1.400000


        one    two
count  3.00   2.00
mean   3.08  -2.95
std    3.49   2.19
min    0.75  -4.50
25%     nan    nan
50%     nan    nan
75%     nan    nan
max    7.10  -1.40


0     a
1     b
2     c
3     c
4     a
5     b
6     c
7     c
8     a
9     b
10    c
11    c
12    a
13    b
14    c
15    c
dtype: object


count     16
unique     3
top        c
freq       8
dtype: object

C:\Users\User\Anaconda2\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

Correlation and covariance

In [146]:
import pandas.io.data as web
all_data={}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')
price = DataFrame({tic: data['Adj Close']
                    for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})
returns = price.pct_change()
print returns.tail()

# correlation and covariance:
print '\n'
print returns.MSFT.corr(returns.IBM)
print '\n'
print returns.MSFT.cov(returns.IBM)

C:\Users\User\Anaconda2\lib\site-packages\pandas\io\data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504


0.495979626103


0.000215957600767

If you run this on a data frame, you will get the full corr/cov matrix:

In [147]:
print returns.corr()
print '\n'
print returns.cov()
print '\n'
print returns.corrwith(returns.IBM)
print '\n'
print returns.corrwith(volume)

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000


          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516


AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64


AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

Uniques

In [149]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

Unique counts

In [150]:
obj.nunique()

4

Counts

In [151]:
print obj.value_counts()
print '\n'
print obj.value_counts(normalize = True)

c    3
a    3
b    2
d    1
dtype: int64


c    0.333333
a    0.333333
b    0.222222
d    0.111111
dtype: float64

Check for membership using 'isin'

In [152]:
print obj
print '\n'
print obj.isin(['b','c'])

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object


0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

<a id='nans'></a>
### Handling missing data

Pandas treats nulls as Nan

In [155]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
print string_data
print '\n'
print string_data.isnull()

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object


0    False
1    False
2     True
3    False
dtype: bool

'None' is also treated as a NaN

In [156]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

Fillna

In [157]:
string_data.fillna('used to be NaN')

0    used to be NaN
1         artichoke
2    used to be NaN
3           avocado
dtype: object

Filtering out missing data:

In [160]:
data = Series([1, np.nan, 3.5, np.nan, 7])
print data.dropna()
print '\n'
print data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64


0    1.0
2    3.5
4    7.0
dtype: float64

Dropna will drop any row containing a missing value

In [162]:
data = DataFrame([[1, 6.5, 3], [1, np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3]])
cleaned = data.dropna()
print data
print '\n'
print cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0


     0    1    2
0  1.0  6.5  3.0

We can control the criteria of dropping nulls through the 'how' and 'thresh' parameters

In [165]:
print data.dropna(how='all')
print '\n'
print data.dropna(thresh=2)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0


     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

We can get creative with fillna

In [170]:
data = Series([1, np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

<a id='merging'></a>
### Merging

Merge/joins (pd.merge is an automatic inner join)

In [3]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 
                 'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b','d'], 
                 'data1': range(3)})               
print df1
print '\n' 
print df2
print '\n' 
print pd.merge(df1, df2)  
print '\n' 
print pd.merge(df1, df2, on='key')

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b


   data1 key
0      0   a
1      1   b
2      2   d


   data1 key
0      1   b


   data1_x key  data1_y
0        0   b        1
1        1   b        1
2        6   b        1
3        2   a        0
4        4   a        0
5        5   a        0

If the column names are different in each object, you specify col names:

In [4]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 
                 'data1': range(7)})
df4 = DataFrame({'rkey': ['a', 'b','d'], 
                 'data1': range(3)}) 
print df3
print '\n' 
print df4
print '\n' 
print pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b


   data1 rkey
0      0    a
1      1    b
2      2    d


   data1_x lkey  data1_y rkey
0        0    b        1    b
1        1    b        1    b
2        6    b        1    b
3        2    a        0    a
4        4    a        0    a
5        5    a        0    a

Outer join:

In [5]:
pd.merge(df1, df2, how='outer', on='key')

   data1_x key  data1_y
0      0.0   b      1.0
1      1.0   b      1.0
2      6.0   b      1.0
3      2.0   a      0.0
4      4.0   a      0.0
5      5.0   a      0.0
6      3.0   c      NaN
7      NaN   d      2.0

Many-to-many merges:

In [6]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                 'data1': range(6)})
df2 = DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 
                 'data1': range(5)}) 
print df1
print '\n' 
print df2
print '\n' 
print pd.merge(df1, df2, on='key', how='left')
print '\n' 
print pd.merge(df1, df2, on='key', how='inner')

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b


   data1 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d


    data1_x key  data1_y
0         0   b      1.0
1         0   b      3.0
2         1   b      1.0
3         1   b      3.0
4         2   a      0.0
5         2   a      2.0
6         3   c      NaN
7         4   a      0.0
8         4   a      2.0
9         5   b      1.0
10        5   b      3.0


   data1_x key  data1_y
0        0   b        1
1        0   b        3
2        1   b        1
3        1   b        3
4        5   b        1
5        5   b        3
6        2   a        0
7        2   a        2
8        4   a        0
9        4   a        2

To merge with multiple keys, pass a list of column names:

In [7]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'], 
                  'key2': ['one', 'two', 'one'], 
                    'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 
                  'key2': ['one', 'one', 'one', 'two'], 
                    'lval': [4, 5, 6, 7]})
print left
print '\n' 
print right
print '\n' 
print pd.merge(left, right, on=['key1', 'key2'], how='outer')
print '\n' 
print pd.merge(left, right, left_on=['key1', 'key2'], right_on=['key1', 'key2'])

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3


  key1 key2  lval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7


  key1 key2  lval_x  lval_y
0  foo  one     1.0     4.0
1  foo  one     1.0     5.0
2  foo  two     2.0     NaN
3  bar  one     3.0     6.0
4  bar  two     NaN     7.0


  key1 key2  lval_x  lval_y
0  foo  one       1       4
1  foo  one       1       5
2  bar  one       3       6

When merging columns with same names, you can specify suffixes to be added:

In [8]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval_left key2_right  lval_right
0  foo       one          1        one           4
1  foo       one          1        one           5
2  foo       two          2        one           4
3  foo       two          2        one           5
4  bar       one          3        one           6
5  bar       one          3        two           7

Merging on Index

In [9]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 
                 'data1': range(6)})
right1 = DataFrame({'group_val': [3.5, 7]}, 
                 index=['a', 'b']) 
print left1
print '\n' 
print right1
print '\n' 
print pd.merge(left1, right1, left_on='key', right_index=True)
print '\n' 
print pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

   data1 key
0      0   a
1      1   b
2      2   a
3      3   a
4      4   b
5      5   c


   group_val
a        3.5
b        7.0


   data1 key  group_val
0      0   a        3.5
2      2   a        3.5
3      3   a        3.5
1      1   b        7.0
4      4   b        7.0


   data1 key  group_val
0      0   a        3.5
2      2   a        3.5
3      3   a        3.5
1      1   b        7.0
4      4   b        7.0
5      5   c        NaN

Hierarchically indexed data (merging index on columns):

In [10]:
lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
                   'key2': [2000, 2001, 2002, 2001, 2002], 
                    'data': np.arange(5.)})
righth = DataFrame(np.arange(12).reshape((6, 2)), 
                   index=[['Nevada', 'Nevada', 'Ohio','Ohio', 'Ohio', 'Ohio'], 
                   [2001, 2000, 2000, 2000, 2001, 2002]], 
                    columns=['event1', 'event2'])
print lefth
print '\n' 
print righth
print '\n' 
print pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)
print '\n' 
print pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, 
         how='outer')

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002


             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11


   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1


   data    key1    key2  event1  event2
0   0.0    Ohio  2000.0     4.0     5.0
0   0.0    Ohio  2000.0     6.0     7.0
1   1.0    Ohio  2001.0     8.0     9.0
2   2.0    Ohio  2002.0    10.0    11.0
3   3.0  Nevada  2001.0     0.0     1.0
4   4.0  Nevada  2002.0     NaN     NaN
4   NaN  Nevada  2000.0     2.0     3.0

Or both indices:

In [11]:
left2 = DataFrame([[1, 2], [3, 4], [5, 6]], index=['a', 'c', 'e'],
                  columns=['Ohio', 'Nevada'])
right2 = DataFrame([[7, 8], [9, 10], [11, 12], [13, 14]],
                   index=['b', 'c', 'd', 'e'], 
                    columns=['Missouri', 'Alabama'])
print left2
print '\n' 
print right2
print '\n' 
print pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada
a     1       2
c     3       4
e     5       6


   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14


   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

<a id='joining'></a>
### Joining

DataFrame has a more convenient join instance for merging by index

In [12]:
print left2
print '\n' 
print right2
print '\n' 
print left2.join(right2, how='outer')

   Ohio  Nevada
a     1       2
c     3       4
e     5       6


   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14


   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

You can also join the index on a key:

In [14]:
print left1
print '\n', right1
print '\n', left1.join(right1, on='key')

   data1 key
0      0   a
1      1   b
2      2   a
3      3   a
4      4   b
5      5   c

   group_val
a        3.5
b        7.0

   data1 key  group_val
0      0   a        3.5
1      1   b        7.0
2      2   a        3.5
3      3   a        3.5
4      4   b        7.0
5      5   c        NaN

_Note:_ The join function doesn't allow you to specify the merge columns on boths sides of the equation!

You can even pass multiple DataFrames into the Join function:

In [15]:
another = DataFrame([[7, 8], [9, 10], [11, 12], [16, 17]], 
                    index=['a', 'c', 'e', 'f'], 
                        columns=['New York', 'Oregon'])
print '\n',left2.join([right2, another])
print '\n',left2.join(right2.join(another))
print '\n',left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
c     3       4       9.0     10.0         9      10
e     5       6      13.0     14.0        11      12

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN       NaN     NaN
c     3       4       9.0     10.0       9.0    10.0
e     5       6      13.0     14.0      11.0    12.0

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

<a id='concat'></a>
### Concatenating

Concatenating Along an Axis:

In [16]:
arr = np.arange(12).reshape((3, 4))
print '\n',arr
print '\n',np.concatenate([arr, arr], axis=1)
print '\n',np.concatenate([arr, arr])

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]

[[ 0  1  2  3  0  1  2  3]
 [ 4  5  6  7  4  5  6  7]
 [ 8  9 10 11  8  9 10 11]]

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]

Let's try it in pandas:

In [17]:
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([5, 6], index=['f', 'g'])
print '\n',s1
print '\n',s2
print '\n',s3
print '\n',pd.concat([s1, s2, s3])

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

If you do it along the columns, it's an outer join:

In [18]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

Intersect

In [19]:
s4 = pd.concat([s1*5, s3])
print '\n',s4
print '\n',s3
print '\n',s1
print '\n',pd.concat([s1, s4], axis=1)
print '\n',pd.concat([s1, s4], axis=1, join = 'inner')

a    0
b    5
f    5
g    6
dtype: int64

f    5
g    6
dtype: int64

a    0
b    1
dtype: int64

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

   0  1
a  0  0
b  1  5

You can specify which axes to be joined on:

In [20]:
print '\n',s1
print '\n',s4
print '\n',pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

a    0
b    1
dtype: int64

a    0
b    5
f    5
g    6
dtype: int64

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

To identify the concatenated pieces you need specify the keys argument:

In [22]:
print '\n',s1
print '\n',s2
print '\n',s3
result = pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])
print '\n',result
print '\n',result.unstack()

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

When you combine Series along Axis=1, then the keys become the col headers:

In [24]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

Same logic applies to DataFrame objects:

In [25]:
df1 = DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                columns = ['one', 'two'])
df2 = DataFrame(5+np.arange(4).reshape(2, 2), index=['a', 'c'],
                columns = ['three', 'four'])
print '\n',df1
print '\n',df2
print '\n',pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])
print '\n',pd.concat([df1, df2], axis=1, keys=['level1', 'level2'], join='inner')

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      5     6
c      7     8

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

  level1     level2
     one two  three four
a      0   1      5    6
c      4   5      7    8

If you pass a dict of objects instead of a list, the dict keys will be used:

In [26]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

When it comes to hierarchical indexing:

In [27]:
pd.concat([df1, df2], axis=1, keys=['level', 'level2'],
          names=['upper', 'lower'])

upper level     level2
lower   one two  three four
a         0   1    5.0  6.0
b         2   3    NaN  NaN
c         4   5    7.0  8.0

If the index is meaningless in the context of the analysis, ignore_index=True

In [28]:
df1 = DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
print '\n',df1
print '\n',df2
print '\n',pd.concat([df1, df2]) # look at the index here
print '\n',pd.concat([df1, df2], ignore_index=True) # now look at it here, dummy

          a         b         c         d
0  1.037979 -1.558202 -1.007774  0.678721
1  0.329565  0.384214 -1.098509 -0.149021
2  3.197560  0.503944  0.226623  0.966872

          b         d         a
0 -0.758085  1.013255 -0.610753
1 -0.132236 -0.666557  0.345436

          a         b         c         d
0  1.037979 -1.558202 -1.007774  0.678721
1  0.329565  0.384214 -1.098509 -0.149021
2  3.197560  0.503944  0.226623  0.966872
0 -0.610753 -0.758085       NaN  1.013255
1  0.345436 -0.132236       NaN -0.666557

          a         b         c         d
0  1.037979 -1.558202 -1.007774  0.678721
1  0.329565  0.384214 -1.098509 -0.149021
2  3.197560  0.503944  0.226623  0.966872
3 -0.610753 -0.758085       NaN  1.013255
4  0.345436 -0.132236       NaN -0.666557

<a id='combining'></a>
### Combining data with overlap

In [29]:
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
           index=['f', 'e', 'd', 'c', 'b', 'a'])
b = Series(np.arange(len(a), dtype=np.float64),
           index=['f', 'e', 'd', 'c', 'b', 'a'])
print '\n',b
b[-1] = np.nan
print '\n',a
print '\n',b
print '\n',np.where(pd.isnull(a), b, a)

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

[ 0.   2.5  2.   3.5  4.5  nan]

Or you can use the combine_first Series function:

In [32]:
print '\n', b[:-2].combine_first(a[2:]) # i think it automatically sorts by index
print '\n', b[:-2]
print '\n', a[2:]

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In DataFrames, think of combine_first as patching missing data:

In [34]:
df1 = DataFrame({'a':[1, np.nan, 5, np.nan],
                 'b':[np.nan, 2, np.nan, 6],
                'c': range(2, 18, 4)})
df2 = DataFrame({'a':[5, 4, np.nan, 3, 7],
                 'b':[np.nan, 3, 4, 6, 8]})
print '\n', df1
print '\n', df2
print '\n', df1.combine_first(df2)

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

<a id='stacking'></a>
### Stacking

Stack rotates the columns to the rows (producing a series below)

In [37]:
data = DataFrame(np.arange(6).reshape((2, 3)), 
                 index=pd.Index(['Ohio', 'Colorado'], name='state'), 
                columns=pd.Index(['one', 'two', 'three'], name='number'))
print '\n', data
result = data.stack()
print '\n', result
print '\n', type(result)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

<class 'pandas.core.series.Series'>

Using unstack, you rearrange a hierarchical index back to a DataFrame:

In [38]:
print '\n', result.unstack()
print '\n', type(result)
print '\n', type(result.unstack())

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

<class 'pandas.core.series.Series'>

<class 'pandas.core.frame.DataFrame'>

You can choose which level to unstack:

In [42]:
print '\n', result
print '\n', result.unstack(0)
print '\n', result.unstack('state')

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

Unstacking might introduce missing data if all the values aren't there:

In [43]:
s1 = Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
print '\n', s1
print '\n', s2
print '\n', data2
print '\n', data2.unstack()

a    0
b    1
c    2
d    3
dtype: int64

c    4
d    5
e    6
dtype: int64

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

Stacking filters out missing data by default:

In [44]:
print '\n', data2.unstack().stack()
print '\n', data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In a DF, the unstacked & stacked levels becomes the lowest levels:

In [45]:
df = DataFrame({'left': result, 'right': result + 5}, 
               columns=pd.Index(['left', 'right'], name='side'))
print '\n', df
print '\n', df.unstack('state')
print '\n', df.unstack('state').stack('side')

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

<a id='duplicates'></a>
### Duplicates

Removing duplicates

In [46]:
data = DataFrame({'k1': ['one']*3 + ['two']*4,
                  'k2': [1,1,2,3,3,4,4]})
print '\n', data
print '\n', data.duplicated()
print '\n', data.drop_duplicates()
print '\n', data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

Specifying which column to dedupe on:

In [47]:
data['v1'] = range(7)
print '\n', data
print '\n', data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
3  two   3   3

By default, the first observed dupe is kept, but we can change all that:

In [49]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

<a id='mapping'></a>
### Mapping

Transforming data using a function or mapping:

In [50]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 
                           'corned beef', 'Bacon', 'pastrami', 'honey ham',
                           'nova lox'], 
                           'Ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
print '\n', data
meat_to_animal = {'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow',
                  'corned beef': 'cow', 'honey ham': 'pig',
                  'nova lox': 'salmon'}
print '\n', meat_to_animal

   Ounces         food
0     4.0        bacon
1     3.0  pulled pork
2    12.0        bacon
3     6.0     Pastrami
4     7.5  corned beef
5     8.0        Bacon
6     3.0     pastrami
7     5.0    honey ham
8     6.0     nova lox

{'pastrami': 'cow', 'bacon': 'pig', 'pulled pork': 'pig', 'corned beef': 'cow', 'nova lox': 'salmon', 'honey ham': 'pig'}

First, we need to convert to lower case:

In [51]:
data['food'].map(str.lower)

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

Or...

In [52]:
data['food'].apply(str.lower)

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

...and then map to the other object:

In [53]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

   Ounces         food  animal
0     4.0        bacon     pig
1     3.0  pulled pork     pig
2    12.0        bacon     pig
3     6.0     Pastrami     cow
4     7.5  corned beef     cow
5     8.0        Bacon     pig
6     3.0     pastrami     cow
7     5.0    honey ham     pig
8     6.0     nova lox  salmon

Or we could get fancy:

In [55]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

<a id='replacing'></a>
### Replacing values

In [58]:
data = Series([1, -999, 2, -999, -1000, 3])
print '\n', data
data.replace(-999, np.nan, inplace=True)
print '\n', data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

replace multiple at once:

In [59]:
print '\n', data.replace([-999, -1000], np.nan)
print '\n', data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

You can also pass a dict instead:

In [60]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

<a id='renaming'></a>
### Renaming Axis Indexes

In [61]:
data = DataFrame(np.arange(12).reshape((3, 4)), 
                 index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
print '\n', data.index.map(str.upper)
data.index = data.index.map(str.upper)
print '\n', data

['OHIO' 'COLORADO' 'NEW YORK']

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

or you can use rename:

In [62]:
print '\n', data
print '\n', data.rename(index=str.title, columns=str.upper)
print '\n', data.rename(index=str.lower)
print '\n', data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

Rename can be used with a dict-like object:

In [65]:
print '\n', data.rename(index={'OHIO': 'INDIANA'}, 
            columns={'three': 'Z MONEY!!'})
_ = data.rename(index={'OHIO': 'INDIANA'})
print '\n', data

          one  two  Z MONEY!!  four
INDIANA     0    1          2     3
COLORADO    4    5          6     7
NEW YORK    8    9         10    11

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

<a id='binning'></a>
### Discretization and Binning

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
print '\n', cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Internally, this stores a 'levels' array indicating category names:

In [68]:
print '\n', cats.codes
print '\n', cats.categories

[0 0 0 1 0 0 2 1 3 2 2 1]

Index([u'(18, 25]', u'(25, 35]', u'(35, 60]', u'(60, 100]'], dtype='object')

Open `(` means exclusive, while `]` means inclusive

In [69]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

We can change this with Right=false

In [70]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, object): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

We can pass our own bin names:

In [71]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
cats = pd.cut(ages, bins, labels=group_names)
print '\n', pd.value_counts(cats)

Youth         5
MiddleAged    3
YoungAdult    3
Senior        1
dtype: int64

You can cut the data set into equal distances based on the actual values:

In [73]:
data = np.random.rand(20)
print '\n', data
print '\n', pd.cut(data, 4, precision=2)
print '\n', pd.value_counts(pd.cut(data, 4, precision=2))

[ 0.03415189  0.05690401  0.96372999  0.43618011  0.10177639  0.05686856
  0.6367132   0.16486978  0.12794947  0.11813673  0.71560211  0.58838665
  0.73440855  0.35596375  0.86203298  0.09643257  0.68806944  0.95027632
  0.44833516  0.82467307]

[(0.033, 0.27], (0.033, 0.27], (0.73, 0.96], (0.27, 0.5], (0.033, 0.27], ..., (0.033, 0.27], (0.5, 0.73], (0.73, 0.96], (0.27, 0.5], (0.73, 0.96]]
Length: 20
Categories (4, object): [(0.033, 0.27] < (0.27, 0.5] < (0.5, 0.73] < (0.73, 0.96]]

(0.033, 0.27]    8
(0.73, 0.96]     5
(0.5, 0.73]      4
(0.27, 0.5]      3
dtype: int64

Or you can cut the data based on quantiles:

In [74]:
data = np.random.randn(1000) # normally distributed
cats = pd.qcut(data, 4) # cuts into quartiles
print '\n', cats
print '\n', pd.value_counts(cats)

[(-0.639, 0.032], (0.032, 0.659], (0.032, 0.659], (-0.639, 0.032], (0.659, 3.717], ..., (-0.639, 0.032], (-0.639, 0.032], (-0.639, 0.032], (0.032, 0.659], (-0.639, 0.032]]
Length: 1000
Categories (4, object): [[-2.777, -0.639] < (-0.639, 0.032] < (0.032, 0.659] < (0.659, 3.717]]

(0.659, 3.717]      250
(0.032, 0.659]      250
(-0.639, 0.032]     250
[-2.777, -0.639]    250
dtype: int64

You can also pass your own quantiles

In [75]:
print '\n', pd.qcut(data, [0, .1, .45, .85, 1])
print '\n', pd.value_counts(pd.qcut(data, [0, .1, .45, .85, 1]))

[(-0.0918, 1.00817], (-0.0918, 1.00817], (-0.0918, 1.00817], (-1.211, -0.0918], (1.00817, 3.717], ..., (-1.211, -0.0918], (-1.211, -0.0918], (-1.211, -0.0918], (-0.0918, 1.00817], (-1.211, -0.0918]]
Length: 1000
Categories (4, object): [[-2.777, -1.211] < (-1.211, -0.0918] < (-0.0918, 1.00817] < (1.00817, 3.717]]

(-0.0918, 1.00817]    400
(-1.211, -0.0918]     350
(1.00817, 3.717]      150
[-2.777, -1.211]      100
dtype: int64

Detecting and Filtering Outliers

In [77]:
np.random.seed(12345)
data = DataFrame(np.random.randn(1000, 4))
print '\n', data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

To find all the values in the last column exceeding 3 (absolute value)

In [80]:
col = data[3]
print '\n', col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

To find values exceeding 3 or -3, use the any method:

In [81]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

Here is how we cap off the data at 3:

In [83]:
print '\n', data[np.abs(data)>3].head()
data[np.abs(data)>3] = np.sign(data)*3
print '\n', data.describe()

    0   1   2   3
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
4 NaN NaN NaN NaN

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

<a id='perm_rand'></a>
### Permutation and Random Sampling:

In [86]:
df = DataFrame(np.arange(5*4).reshape(5, 4))
# to randomly reorder the rows, use np.random.permutation with 'take':
sampler = np.random.permutation(5)
print '\n', sampler
print '\n', df
print '\n', df.take(sampler)
sampler = np.random.permutation(4)
print '\n', df.take(sampler, axis=1)

[1 0 4 3 2]

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

    1   0   2   3
0   1   0   2   3
1   5   4   6   7
2   9   8  10  11
3  13  12  14  15
4  17  16  18  19

To select a random subset without replacement, we can do this janky method:

In [87]:
df.take(np.random.permutation(len(df))[:3]) # takes first 3 random rows

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7

To sample WITH replacement, use np.random.randint:

In [84]:
bag = np.array([5, 7, -1, 6, 4])
sampler = np.random.randint(0, len(bag), size=10)
sampler

array([4, 3, 2, 2, 2, 4, 4, 4, 4, 2])

In [85]:
draws= bag.take(sampler) 
draws #question: NOT a question...comment: this super janky!

array([ 4,  6, -1, -1, -1,  4,  4,  4,  4, -1])

Computing Indicator/Dummy Variables:

In [90]:
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                'data1': range(6)})
print '\n', df
print '\n', pd.get_dummies(df['key'])

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

Or add a prefix to the column names:

In [89]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
print '\n', dummies
df_with_dummy = df[['data1']].join(dummies)
print '\n', df_with_dummy

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

We'll probably want to drop the first category...

In [198]:
print '\n', pd.get_dummies(df['key'],drop_first=True)

KeyError: 'key'

<a id='strings'></a>
### String manipulation

Split:

In [93]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

Strip (trim):

In [94]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

Concatenation:

In [97]:
first, second, third = pieces
print '\n', pieces
print '\n', first + '::' + second + '::' + third

['a', 'b', 'guido']

a::b::guido

Faster concatenation is with join:

In [96]:
'::'.join(pieces)

'a::b::guido'

To find substrings, use 'in' or 'index' or 'find':

In [99]:
print '\n', 'guido' in val
print '\n', val.index(',')
print '\n', val
print '\n', val.find('&')
print '\n', val.find('b')

True

1

a,b, guido

-1

2

Index raises an exception if the string isn't found:

In [100]:
val.index(':')

ValueError: substring not found

Count string values:

In [101]:
val.count(',')

2

Replace

In [102]:
print '\n', val.replace(',', '::')
print '\n', val.replace(',','')

a::b:: guido

ab guido

<a id='grouping'></a>
### Grouping and aggregation

In [103]:
df = DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                'key2' : ['one', 'two', 'one', 'two', 'one'],
                'data1' : np.random.randn(5),
                'data2' : np.random.randn(5)})
print '\n', df
# getting the average of data1 using key1
grouped = df['data1'].groupby(df['key1'])
print '\n', grouped
print '\n', grouped.mean()

      data1     data2 key1 key2
0  1.986957 -1.140450    a  one
1 -0.748540  0.130485    a  two
2  0.617442 -0.089647    b  one
3  2.310407 -0.723089    b  two
4 -0.052347 -0.199605    a  one

<pandas.core.groupby.SeriesGroupBy object at 0x00000000085743C8>

key1
a    0.395357
b    1.463925
Name: data1, dtype: float64

If we passed multiple arrays as a list, we get something different:

In [104]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
print '\n', means
print '\n', means.unstack()

key1  key2
a     one     0.967305
      two    -0.748540
b     one     0.617442
      two     2.310407
Name: data1, dtype: float64

key2       one       two
key1
a     0.967305 -0.748540
b     0.617442  2.310407

We can also change the keys to be arrays:

In [105]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -0.748540
            2006    0.617442
Ohio        2005    2.148682
            2006   -0.052347
Name: data1, dtype: float64

We can pass column names as group keys:

In [107]:
print '\n', df.groupby('key1').mean()
print '\n', df.groupby(['key1', 'key2']).mean()

         data1     data2
key1
a     0.395357 -0.403190
b     1.463925 -0.406368

              data1     data2
key1 key2
a    one   0.967305 -0.670028
     two  -0.748540  0.130485
b    one   0.617442 -0.089647
     two   2.310407 -0.723089

Size:

In [109]:
print '\n', df
print '\n', df.groupby(['key1', 'key2']).size()

      data1     data2 key1 key2
0  1.986957 -1.140450    a  one
1 -0.748540  0.130485    a  two
2  0.617442 -0.089647    b  one
3  2.310407 -0.723089    b  two
4 -0.052347 -0.199605    a  one

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

Iterating over groups:

In [110]:
for name, group in df.groupby('key1'):
    print name
    print group

a
      data1     data2 key1 key2
0  1.986957 -1.140450    a  one
1 -0.748540  0.130485    a  two
4 -0.052347 -0.199605    a  one
b
      data1     data2 key1 key2
2  0.617442 -0.089647    b  one
3  2.310407 -0.723089    b  two

In case of multiple keys, 1st element in the tuple is a tuple of value keys:

In [111]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print k1, k2
    print group

a one
      data1     data2 key1 key2
0  1.986957 -1.140450    a  one
4 -0.052347 -0.199605    a  one
a two
     data1     data2 key1 key2
1 -0.74854  0.130485    a  two
b one
      data1     data2 key1 key2
2  0.617442 -0.089647    b  one
b two
      data1     data2 key1 key2
3  2.310407 -0.723089    b  two

Computing a dict of the data pieces as a one-liner:

In [112]:
pieces = dict(list(df.groupby('key1')))
print '\n', pieces['b']
print '\n', pieces['a']

      data1     data2 key1 key2
2  0.617442 -0.089647    b  one
3  2.310407 -0.723089    b  two

      data1     data2 key1 key2
0  1.986957 -1.140450    a  one
1 -0.748540  0.130485    a  two
4 -0.052347 -0.199605    a  one

We can group by any of the axes, tho default is axis=0:

In [122]:
print df.dtypes
grouped = df.groupby(['key1', 'key2'], axis=1)
print '\n', grouped.mean()

data1    float64
data2    float64
key1      object
key2      object
dtype: object

Empty DataFrame
Columns: []
Index: []

Select a Column or Subset of Columns:
- indexing a groupby object using a column name has the effect of selecting:

In [123]:
df.groupby('key1')['data1'] # is the same as:
df['data1'].groupby(df['key1'])

To compute means for just data2 column and get a DF as output:

In [125]:
df.groupby(['key1', 'key2'])[['data2']].mean() # note: same as:
df['data2'].groupby([df['key1'],df['key2']]).mean()

key1  key2
a     one    -0.670028
      two     0.130485
b     one    -0.089647
      two    -0.723089
Name: data2, dtype: float64

The object returned by this indexing operation is a grouped DF or Series:

In [126]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
print '\n', s_grouped
df_grouped = df.groupby(['key1', 'key2'])
print '\n', df_grouped

<pandas.core.groupby.SeriesGroupBy object at 0x0000000008574FD0>

<pandas.core.groupby.DataFrameGroupBy object at 0x00000000086C52E8>

Grouping with Dicts and Series:

In [128]:
# create a dataframe
people = DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'], 
                    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
print '\n', people
# create a group correspondence
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}

# we could construct an array from this dict & pass to groupby, or:
by_column = people.groupby(mapping, axis=1)
print '\n', by_column.sum()
people.groupby(mapping, axis=1).sum()
by_column = people.groupby(mapping)
print '\n', by_column.sum() #this no worky b/c the corresponding group exists on axis 1

               a         b         c         d         e
Joe    -0.980581  0.457827  1.425805  1.382314 -0.581621
Steve   0.585618 -0.609188 -0.083433 -0.129360  0.762553
Wes    -0.169808  0.570705 -1.122823 -1.536693  0.091255
Jim     0.228190  0.383707  0.486570  1.305298  0.488750
Travis -0.080597 -0.120046  0.664978  0.580139  0.598920

            blue       red
Joe     2.808119 -1.104375
Steve  -0.212793  0.738983
Wes    -2.659516  0.492151
Jim     1.791868  1.100647
Travis  1.245117  0.398277

Empty DataFrame
Columns: [a, b, c, d, e]
Index: []

The same thing holds for Series:

In [133]:
map_series = Series(mapping)
print '\n', map_series
print '\n', people.groupby(map_series, axis=1).count()

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

<a id='agg_func'></a>
### Data grouping aggregation with functions

In [134]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.922200  1.412239  0.789553  1.150919 -0.001616
5  0.585618 -0.609188 -0.083433 -0.129360  0.762553
6 -0.080597 -0.120046  0.664978  0.580139  0.598920

You can mix functions with arrays, dicts, or Series:

In [135]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.980581  0.457827 -1.122823 -1.536693 -0.581621
  two  0.228190  0.383707  0.486570  1.305298  0.488750
5 one  0.585618 -0.609188 -0.083433 -0.129360  0.762553
6 two -0.080597 -0.120046  0.664978  0.580139  0.598920

Grouping by index levels:

In [136]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]], names=['cty', 'tenor'])
hier_df = DataFrame(np.random.randn(4, 5), columns=columns)
hier_df
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

Aggregations

In [137]:
df
grouped = df.groupby('key1')
grouped
grouped['data1'].quantile(.9)

key1
a    1.579097
b    2.141111
Name: data1, dtype: float64

Use the agg or aggregate method to pass my own aggregation functions:

In [139]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.735497  1.270936
b     1.692965  0.633442

Some methods likae describe work, but they're not aggregations:

In [140]:
grouped.describe()

               data1     data2
key1
a    count  3.000000  3.000000
     mean   0.395357 -0.403190
     std    1.421642  0.659473
     min   -0.748540 -1.140450
     25%   -0.400444 -0.670028
     50%   -0.052347 -0.199605
     75%    0.967305 -0.034560
     max    1.986957  0.130485
b    count  2.000000  2.000000
     mean   1.463925 -0.406368
     std    1.197107  0.447911
     min    0.617442 -0.723089
     25%    1.040684 -0.564729
     50%    1.463925 -0.406368
     75%    1.887166 -0.248008
     max    2.310407 -0.089647

More comprehensive example:

In [143]:
import os
os.chdir('C:\\Users\\User\\Dropbox\\Documents\\Analytics\\Learning\\Data-Science-Curriculum\\Data')

In [145]:
tips = pd.read_csv('tips.csv')
tips['tip_pct'] = tips['tip']/tips['total_bill']
print '\n', tips.head()
print '\n', tips.describe()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345

Column-wise and Multiple Function Application

In [146]:
grouped = tips.groupby(['sex', 'smoker'])
grouped_pct = grouped['tip_pct']
print '\n', grouped_pct.agg('mean')
print '\n', tips.groupby(['sex','smoker'])[['tip_pct']].mean() #note that it's the same

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

                tip_pct
sex    smoker
Female No      0.156921
       Yes     0.182150
Male   No      0.160669
       Yes     0.152771

You can pass multiple functions

In [147]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

Naming the aggregate functions:

In [148]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

With a dataframe, we have more options (you can specify a list):

In [149]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
print '\n', result
print '\n', result['tip_pct']

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

If you want to pass different functions to different columns, use a dict:

In [150]:
print '\n', grouped.agg({'tip':np.max, 'size':'sum'}) #question: how to label 'max'&'sum'
print '\n', grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std',], 'size' : 'sum'})

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

Returning Aggregated Data in 'unindexed' Form

In [151]:
tips.groupby(['sex', 'smoker'], as_index=False).mean()
# note, you can always get results in this format using 'reset_index'

      sex smoker  total_bill       tip      size   tip_pct
0  Female     No   18.105185  2.773519  2.592593  0.156921
1  Female    Yes   17.977879  2.931515  2.242424  0.182150
2    Male     No   19.791237  3.113402  2.711340  0.160669
3    Male    Yes   22.284500  3.051167  2.500000  0.152771

Group-wise Operations and Transformations
- say we want to add a column that contains group means for each index:

In [157]:
print '\n', df
k1_means = df.groupby('key1').mean().add_prefix('mean_')
print '\n', k1_means
pd.merge(df, k1_means, left_on='key1', right_index=True)

# that was the long way. let' look at this example:
people = DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'], 
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people
key = ['one', 'two', 'one', 'two', 'one']
print '\n', people.groupby(key).mean()
print '\n', people.groupby(key).transform(np.mean)

      data1     data2 key1 key2
0  1.986957 -1.140450    a  one
1 -0.748540  0.130485    a  two
2  0.617442 -0.089647    b  one
3  2.310407 -0.723089    b  two
4 -0.052347 -0.199605    a  one

      mean_data1  mean_data2
key1
a       0.395357   -0.403190
b       1.463925   -0.406368

            a         b         c         d         e
one -0.180055  0.471920  0.173102 -0.565981  0.661865
two  0.506032  0.106457  0.184515 -0.116158 -0.622957

               a         b         c         d         e
Joe    -0.180055  0.471920  0.173102 -0.565981  0.661865
Steve   0.506032  0.106457  0.184515 -0.116158 -0.622957
Wes    -0.180055  0.471920  0.173102 -0.565981  0.661865
Jim     0.506032  0.106457  0.184515 -0.116158 -0.622957
Travis -0.180055  0.471920  0.173102 -0.565981  0.661865

Suppose you want to subtract the mean from each group:

In [162]:
def demean(arr):
    return arr - arr.mean()
demeaned = people.groupby(key).transform(demean)
demeaned

               a         b         c         d         e
Joe    -0.594847 -1.059269  0.746217  0.763309  0.959912
Steve   0.379150 -0.655239 -0.937633  0.061014 -0.626335
Wes     1.230581  0.038952 -0.687520 -0.927568 -0.729784
Jim    -0.379150  0.655239  0.937633 -0.061014  0.626335
Travis -0.635734  1.020317 -0.058696  0.164259 -0.230128

In [161]:
people['a'].ix['Steve']-.506032

0.37915006696151388

Check that demeaned has zero group means:

In [154]:
demeaned.groupby(key).mean()

                a             b             c    d             e
one -7.401487e-17  0.000000e+00  7.401487e-17  0.0 -1.850372e-17
two  0.000000e+00 -5.551115e-17  0.000000e+00  0.0 -1.387779e-17

Apply: general split-apply-combine
- selecting top 5 tip_pct values by group -

In [164]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]
top(tips, n=6)

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

If we group by smoke and call apply, we get:

In [165]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

You can pass other parameters into the function:

In [171]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

result = tips.groupby('smoker')['tip_pct'].describe()
print '\n', result
print '\n', result.unstack('smoker')

smoker
No      count    151.000000
        mean       0.159328
        std        0.039910
        min        0.056797
        25%        0.136906
        50%        0.155625
        75%        0.185014
        max        0.291990
Yes     count     93.000000
        mean       0.163196
        std        0.085119
        min        0.035638
        25%        0.106771
        50%        0.153846
        75%        0.195059
        max        0.710345
Name: tip_pct, dtype: float64

smoker          No        Yes
count   151.000000  93.000000
mean      0.159328   0.163196
std       0.039910   0.085119
min       0.056797   0.035638
25%       0.136906   0.106771
50%       0.155625   0.153846
75%       0.185014   0.195059
max       0.291990   0.710345

You can disable the hierarchical index by:

In [169]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

<a id='groupby_bucketing'></a>
### Groupby with bucketing

In [172]:
# Quantile and Bucket Analysis
frame = DataFrame({'data1': np.random.randn(1000),
                   'data2': np.random.randn(1000)})
frame
factor = pd.cut(frame.data1, 4)
factor[:10]

0     (-1.15, 0.368]
1    (-2.674, -1.15]
2    (-2.674, -1.15]
3     (-1.15, 0.368]
4     (-1.15, 0.368]
5     (0.368, 1.886]
6     (-1.15, 0.368]
7     (-1.15, 0.368]
8     (0.368, 1.886]
9     (-1.15, 0.368]
Name: data1, dtype: category
Categories (4, object): [(-2.674, -1.15] < (-1.15, 0.368] < (0.368, 1.886] < (1.886, 3.404]]

The factor object returned by cut can be passed directly to groupby, so we could compute a set of statistics for the data2 column like so:

In [173]:
def get_stats(group):
    return{'min': group.min(), 'max': group.max(), 
           'count': group.count(), 'mean': group.mean()}
grouped = frame.data2.groupby(factor)
grouped = frame['data2'].groupby(factor) # note: same as previous row!
grouped.apply(get_stats).unstack()

                 count       max      mean       min
data1
(-2.674, -1.15]  124.0  2.066999  0.029440 -2.340085
(-1.15, 0.368]   531.0  2.558880 -0.008859 -3.380646
(0.368, 1.886]   326.0  2.535171 -0.021036 -2.681868
(1.886, 3.404]    19.0  1.168986 -0.340257 -2.228179

Or we could compute equal-size buckets based on sample quantiles:

In [174]:
grouping = pd.qcut(frame.data1, 10, labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.066999  0.058914 -1.973643
1      100.0  2.351557 -0.111474 -2.340085
2      100.0  2.211709  0.074116 -1.991595
3      100.0  1.996386 -0.078983 -2.045666
4      100.0  2.558880  0.112800 -2.701379
5      100.0  2.145419 -0.009112 -3.380646
6      100.0  1.924108 -0.102423 -2.472804
7      100.0  2.314302 -0.044785 -2.387682
8      100.0  2.535171 -0.050433 -2.681868
9      100.0  2.131001  0.007619 -2.228179

Example: filling missing values with group-specific values

In [176]:
s = Series(np.random.randn(6))
print '\n', s
print '\n', s[:2]
print '\n', s[::2]
s[::2] = np.nan
print '\n', s
print '\n', s.fillna(s.mean())

0    0.015510
1    0.713556
2   -2.014549
3    1.890530
4    0.530680
5   -0.458383
dtype: float64

0    0.015510
1    0.713556
dtype: float64

0    0.015510
2   -2.014549
4    0.530680
dtype: float64

0         NaN
1    0.713556
2         NaN
3    1.890530
4         NaN
5   -0.458383
dtype: float64

0    0.715234
1    0.713556
2    0.715234
3    1.890530
4    0.715234
5   -0.458383
dtype: float64

Filling in NAs by group values:

In [177]:
states = ['Ohio', 'New York', 'Vermont', 'Florida', 'Oregon', 'Nevada',
          'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = Series(np.random.randn(8), index=states)
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data
group_key
data.groupby(group_key).mean()
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio          0.482648
New York     -1.106630
Vermont      -0.421722
Florida      -0.641186
Oregon       -0.517017
Nevada        0.459876
California    1.436770
Idaho         0.459876
dtype: float64

Or, if you have pre-defined values that vary by group:

In [ ]:
# 
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

<a id='cards_example'></a>
### Example: Random Sampling and Permutation
- Hearts, Spades, Clubs, Diamonds - first let's make the deck:

In [178]:
suits = ['H', 'S', 'C', 'D']
card_val = (range(1, 11) + [10]*3)*4
card_val
base_names = ['A'] + range(2, 11) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)
deck = Series(card_val, index=cards)
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

To draw a hand of 5 cards from the deck:

In [179]:
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n])
draw(deck)

AH      1
8S      8
10H    10
KH     10
10D    10
dtype: int64

To draw to random cards from each suit:

In [180]:
get_suit = lambda card: card[-1] # last leter is suit
deck.groupby(get_suit).apply(draw, n=2)

C  9C      9
   6C      6
D  10D    10
   QD     10
H  2H      2
   9H      9
S  9S      9
   7S      7
dtype: int64

Alternatively:

In [181]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

8C     8
7C     7
AD     1
QD    10
AH     1
2H     2
JS    10
AS     1
dtype: int64

<a id='pivot_tables'></a>
### Pivot Tables  
(note: it calculates means by default)

In [182]:
tips.pivot_table(index=['sex', 'smoker']) # note, you can do this w/ groupby

                   size       tip   tip_pct  total_bill
sex    smoker
Female No      2.592593  2.773519  0.156921   18.105185
       Yes     2.242424  2.931515  0.182150   17.977879
Male   No      2.711340  3.113402  0.160669   19.791237
       Yes     2.500000  3.051167  0.152771   22.284500

Let's limit the metrics, and put smoke in the table columns:

In [183]:
tips.pivot_table(['tip_pct', 'size'], index=['sex', 'day'],
                 columns='smoker')

              tip_pct                size
smoker             No       Yes        No       Yes
sex    day
Female Fri   0.165296  0.209129  2.500000  2.000000
       Sat   0.147993  0.163817  2.307692  2.200000
       Sun   0.165710  0.237075  3.071429  2.500000
       Thur  0.155971  0.163073  2.480000  2.428571
Male   Fri   0.138005  0.144730  2.000000  2.125000
       Sat   0.162132  0.139067  2.656250  2.629630
       Sun   0.158291  0.173964  2.883721  2.600000
       Thur  0.165706  0.164417  2.500000  2.300000

We can get totals by doing margins=True

In [184]:
tips.pivot_table(['tip_pct', 'size'], index=['sex', 'day'],
                 columns='smoker', margins=True)

              tip_pct                          size
smoker             No       Yes       All        No       Yes       All
sex    day
Female Fri   0.165296  0.209129  0.199388  2.500000  2.000000  2.111111
       Sat   0.147993  0.163817  0.156470  2.307692  2.200000  2.250000
       Sun   0.165710  0.237075  0.181569  3.071429  2.500000  2.944444
       Thur  0.155971  0.163073  0.157525  2.480000  2.428571  2.468750
Male   Fri   0.138005  0.144730  0.143385  2.000000  2.125000  2.100000
       Sat   0.162132  0.139067  0.151577  2.656250  2.629630  2.644068
       Sun   0.158291  0.173964  0.162344  2.883721  2.600000  2.810345
       Thur  0.165706  0.164417  0.165276  2.500000  2.300000  2.433333
All          0.159328  0.163196  0.160803  2.668874  2.408602  2.569672

We change the measure using aggfunc (note that len is the same as count):

In [185]:
tips.pivot_table('tip_pct', index=['sex', 'smoker'], columns='day',
                 aggfunc=len, margins=True)
tips.pivot_table('tip_pct', index=['sex', 'smoker'], columns='day',
                 aggfunc='count', margins=True)

day             Fri   Sat   Sun  Thur    All
sex    smoker
Female No       2.0  13.0  14.0  25.0   54.0
       Yes      7.0  15.0   4.0   7.0   33.0
Male   No       2.0  32.0  43.0  20.0   97.0
       Yes      8.0  27.0  15.0  10.0   60.0
All            19.0  87.0  76.0  62.0  244.0

If some combos are empty or NA, you can pass fill_value:

In [188]:
display(tips.pivot_table('size', index=['time', 'sex', 'smoker'],
                 columns='day', aggfunc='sum', fill_value=0))
display(tips.pivot_table('size', index=['time', 'sex', 'smoker'],
                 columns='day', aggfunc='sum'))

day                   Fri  Sat  Sun  Thur
time   sex    smoker
Dinner Female No        2   30   43     2
              Yes       8   33   10     0
       Male   No        4   85  124     0
              Yes      12   71   39     0
Lunch  Female No        3    0    0    60
              Yes       6    0    0    17
       Male   No        0    0    0    50
              Yes       5    0    0    23

day                    Fri   Sat    Sun  Thur
time   sex    smoker
Dinner Female No       2.0  30.0   43.0   2.0
              Yes      8.0  33.0   10.0   NaN
       Male   No       4.0  85.0  124.0   NaN
              Yes     12.0  71.0   39.0   NaN
Lunch  Female No       3.0   NaN    NaN  60.0
              Yes      6.0   NaN    NaN  17.0
       Male   No       NaN   NaN    NaN  50.0
              Yes      5.0   NaN    NaN  23.0

<a id='cross_tabs'></a>
### Cross-Tabulations: Crosstab
- cross tabs are special cases of pivot tables that compute group frequencies

In [197]:
display(pd.crosstab([tips.time, tips.day], tips.smoker, margins=True))
display(tips.pivot_table('size', index=['time', 'day'], columns='smoker', aggfunc='count',
                 margins=True)) # use count or len

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

smoker          No   Yes    All
time   day
Dinner Fri     3.0   9.0   12.0
       Sat    45.0  42.0   87.0
       Sun    57.0  19.0   76.0
       Thur    1.0   NaN    1.0
Lunch  Fri     1.0   6.0    7.0
       Thur   44.0  17.0   61.0
All          151.0  93.0  244.0